# -*- coding: utf-8 -*-
"""
Задание 4.2

Преобразовать строку mac из формата XXXX:XXXX:XXXX в формат XXXX.XXXX.XXXX

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""

mac = "AAAA:BBBB:CCCC"
tochka1 = '.'
tochka2 = '.'
print(f'AAAA{tochka1}BBBB{tochka2}CCCC')


# Это задание надо переделать
# написать ответ руками это не совсем решение :)
# надо получить результат используя переменную mac

